//Спроектувати клас для представлення неправильного дробу, що задається мішаним числом: 
//ціла частина, чисельник дробової частини, знаменник дробової частини.
//Клас повинен мати конструктор з параметром, яким є рядок виду “ціла_частина чисельник_дробової_частини / знаменник_дробової_частини”(наприклад, «3 2 / 5»), 
//можливо інші конструктори, метод виведення об'єкта-дробу, можливо інші методи введення/виведення, методи для виконання поставлених завдань. 
//Розробити програму, яка створює два неправильних дроби і знаходить їх суму (з використанням перевантаженого оператора «+»). 
//Програма повинна забезпечувати наочне виведення усіх вхідних, вихідних та проміжних даних 
//(з використанням перевантаженого стандартного оператора потокового виведення «<<»).

#include "Number.h"
#include <iostream>

int main() {

	Number a("3 2 / 5");
	Number b("4 3 / 5");

	Number c = a + b;

	cout << "First num: " << endl;
	a.outputFraction();

	cout << "Second num: " << endl;
	b.outputFraction();

	cout << "Nums after +: " << endl;
	c.outputFraction();

}